{"id":"160853","urlID":"3a8tv","name":"date","description":"- getting date-data\n- not perfekt yet","content":"Michael Braukus \nHeadquarters, Washington, DC                  December 22, 2000\n(Phone: 202\/358-1979)\n\nRELEASE: 00-200\n\nNASA SELECTS INNOVATIVE SMALL BUSINESS PROJECTS\n\n     Developing a new class of deep sea vehicles for sample \ncollection is just one of the 280 research proposals NASA has \nselected for Phase I contract awards as part of its Small Business \nInnovation Research Program. The combined total of the awards is \nexpected to be more than $19 million.\n\nThe goals of the Small Business Innovation Research Program (SBIR) \nare to stimulate technological innovation, increase the use of \nsmall business, including women-owned and disadvantaged firms in \nmeeting federal research and development needs, and increase \nprivate sector commercialization of federally funded research \nresults.\n\nNASA received 1,847 proposals, submitted by small, high technology \nbusinesses from across the country. The proposals were reviewed \nfor technical merit and feasibility and relevance to NASA research \nand technology requirements. The selected firms will be awarded \nfixed-price contracts valued up to $70,000 each to perform a six-\nmonth Phase I feasibility study. \n\nCompanies which successfully complete the phase 1 activities are \neligible to compete for Phase II selection the following year. The \nphase 2 award allows for a two-year, fixed-price contract in the \namount up to $600,000. \n\nThe NASA SBIR Program Management Office is located at the Goddard \nSpace Flight Center, Greenbelt, MD, with executive oversight by \nNASA's Office of Aerospace Technology, NASA Headquarters, \nWashington, DC. Individual SBIR projects are managed by NASA's ten \nfield centers. \n\n                            - end - \n\nNOTE TO EDITORS: A listing of the selected companies can be \naccessed on the internet at URL: http:\/\/sbir.nasa.gov after 4 \np.m., Dec. 22, 2000.","weightedVote":"2.5","numVotes":"0","author":"Jonathan Stoye","community":"1","dateAdded":"2015-01-22","pattern":"([a-zA-Z]{2,9}[.]?[ ][0-9]{1,2}[,][ ][0-9]{2,4})|([0-9]{2}[.-][0-9]{2}[.-][0-9]{2,4})","replace":"","state":""}