{"id":"145237","urlID":"38r5v","name":"adnre","description":"","content":"1.Informasi transaksi online di Indonesia didapatkan dari survei yang hanya melibatkan pembeli online dalam jumlah kecil (DailySocial, 2012).  \n2. Pengumpulan informasi transaksi dari para penjual online tidak efektif karena jumlah penjual yang banyak dan informasi tersebut merupakan data rahasia bagi para penjual. \n3. Makalah ini mengeksplorasi analisis konten tweet dari twitter  untuk mengumpulkan secara otomatis informasi transaksi online di Indonesia. \n4. Pengguna twitter dari Indonesia telah mencapai 30 juta pada Juli 2012 (Semiocast, 2012). \n5. Microblog ini telah digunakan para penggunanya untuk menulis berbagai aktifitas termasuk aktifitas dalam melakukan transaksi online.  \n6. Selain itu, transaksi online dilakukan pengguna twitter lebih banyak 24% dibandingkan rata-rata pengguna internet lainnya (Boorstin, 2012). \n7. Analisis konten tweet berbahasa Indonesia sudah dilakukan untuk berbagai kepentingan seperti analisis opini dan sentimen (Romelta, 2012; Sunni & Widyantoro, 2012; Aliandu, 2012), klasifikasi tweet kemacetan lalu lintas (Rodiyansyah, 2012), ekstraksi informasi kemacetan lalu lintas (Hasby & Khodra, 2013; Endarnoto dkk, 2011), ataupun peringkasan untuk menjelaskan trending topic pada twitter Indonesia (Winatmoko & Khodra, 2013). \n8. Aplikasi analisis yang dikembangkan disebut dengan SaFE-F yang melakukan pencarian tweet (Search) dengan kata kunci tertentu, memfilter konten tweet yang relevan dengan kegiatan transaksi online (Filter), mengekstraksi informasi transaksi online (Ekstraksi), dan menyimpan hasil ekstraksi dalam bentuk yang lebih terstruktur (Filling). \n9. Selain mengembangkan aplikasi SaFE-F, penelitian ini juga berkontribusi dalam mengkonstruksi korpus tweet yang telah dilabeli informasi transaksi online, dan mengembangkan model ekstraksi berbasis klasifikasi untuk mengekstraksi informasi transaksi online pada tweet berbahasa Indonesia (Hasby & Khodra, 2013).\n","weightedVote":"2.5","numVotes":"0","author":"","community":"1","dateAdded":"2014-05-13","pattern":"[(](( ?[^,.]+, ?\\d{4});?)+[)]","replace":"","state":""}