{"id":"157899","urlID":"3a091","name":"widget","description":"","content":"<p>På en markedsplads, <br \/>hvor jeg var færdig med at spille. <br \/>Stod jeg træt og kold bag scenen og slapped' af. <br \/>Da jeg hørte nogen mumle ganske stille. <br \/>Og en mand med en lille hund, <br \/>så på mig og sag':<\/p><p> <a class=\"-widget -widget\" href=\"http:\/\/finans.dk\/live\/it\/article7148989.ece\" id=\"_5d665321-8e6d-4a4d-a259-129e4a29becd\">Toolbox - heatmap IBM<\/a> <\/p>\n<p>Hej du spillemand, <br \/>vil du sig' mig med det samme. <br \/>Og vær' ærlig, for jeg mener hvert et ord. <br \/>Når Vorherre, slukker livets flamme, <br \/>og man skal forlade denne jord. <br \/>Må man ta' hunden med sig ind i himlen? <br \/>Den er sød og den har vær't min bedste ven. <br \/>Den er klog og fin, <br \/>og har lige vær't i bad. <br \/>Hvis man må du Spillemand, <br \/>så bli'r jeg glad. <\/p><p> <a href=\"http:\/\/finans.dk\/finans\/penge\/ECE7124649\/Danica-tvunget-til-at-forlænge-omvalgsperiode-for-kunde\/\" id=\"_e11df90e-fe40-43f0-9d92-53e04351afea\">Danica tvunget til at forlænge omvalgsperiode for kunde<\/a><br \/><br \/>Jeg svared' ham lidt kort da jeg sagde hør': <br \/>En hund kommer nok i himlen når den dør. <br \/>Det var sent, og jeg sku' køre hjem. <br \/>Og da jeg satte i bilen, <br \/>tænkte jeg på manden igen. <br \/><br \/>Hej du spillemand… <br \/><br \/>For ham, var sagen jo så vigtig. <br \/>Han fortjente, at få et ærligt svar. <br \/>Men hvem, kan mon svare helt oprigtigt. <br \/>På om hunde der dør, <br \/>får plads hos himmelens far. <br \/><br \/>Hej du spillemand, <br \/>vil du sig' mig med det samme. <br \/>Og vær' ærlig, for jeg mener hvert et ord. <br \/>Når Vorherre, slukker livets flamme, <br \/>og man skal forlade denne jord. <br \/>Må man ta' hunden med sig ind i himlen? <br \/>Den er sød og den har vær't min bedste ven. <br \/>Den er klog og fin, <br \/>og har lige vær't i bad. <br \/>Hvis man må du Spillemand, \n<br \/>så bli'r jeg glad.<\/p>\n","weightedVote":"2.5","numVotes":"0","author":"","community":"1","dateAdded":"2014-12-01","pattern":"(<p>)?\\s?<a[^\"]*\"[^\"]*-widget[^\"]*\"[^<]*<\/a>\\s*(<\/p>)?","replace":"","state":""}