{"id":"175960","urlID":"3bl68","name":"SPlit IMOKMAN talk","description":"Marked pax talking; being split to individual block ","content":"DR.18.6.2015 3    setanding dengan negara-negara maju yang lain.  Saya juga berharap agar semua pihak  khususnya Ahli-ahli Yang Berhormat terus memberikan sokongan padu bagi menjayakan pelan  pendidikan yang telah dilancarkan ini.  >>**IMOKMANDatuk Sapawi bin Haji Ahmad [Sipitang]:  Terima kasih Tuan Yang di-Pertua dan terima  kasih Yang Berhormat Menteri yang menjawab pertanyaan yang begitu menyeluruh.  Kita ucapkan  tahniah kepada Kementerian Pendidikan yang melaksanakan program yang sangat berkesan ini  terutama sekali sebagai persiapan untuk menjayakan wawasan negara maju berpendapatan tinggi.   Soalan saya di sini ialah daripada lonjakan pertama, kedua, ketiga dan keempat dan  seluruh aspek yang ditekankan dalam pengajian tinggi ini dalam pembangunan pendidikan,  bagaimana sambutan universiti IPTS yang lebih banyak kedudukannya dibandingkan dengan IPT  awam. Bagaimanakah kayu pengukur kejayaan antara universiti dalam menjayakan misi dan visi  PPPM di peringkat pengajian tinggi, terima kasih.  >>**IMOKMANDato’ Seri Haji Idris Jusoh:  Dalam pelaksanaan Pelan Pembangunan Pendidikan  Malaysia PT ini kita tidak membezakan di antara IPTA dan IPTS.  Apabila kita mengadakan IPT, ia  merangkumi IPTA dan IPTS.  Dengan pelan pembangunan ini akan melihat satu penyatuan di  antara IPTA dan IPTS untuk terus menjayakan sistem pendidikan pengajian tinggi di dalam negara  kita ini.  Memang kita katakan pelan ini ialah berakhir pada 2025 dan ada kayu ukur-kayu ukur  yang telah ditetapkan dalam pelan ini untuk memastikan kita boleh melihat prestasi yang boleh  dicapai oleh IPT kita.    >>**IMOKMANTuan M. Kulasegaran [Ipoh Barat]:  Terima kasih Tuan Yang di-Pertua, terima kasih  Yang Berhormat Menteri.  Terima kasih kepada jawapan yang diberi.  Saya hendak tanya  mengenai kayu ukur yang sedia ada di mana standard yang kita ada dalam penggunaan bahasa  Inggeris sangat teruk.  Kebelakangan ini severe drop dalam standard ini.  Jadi maka dengan pelan  yang dicadangkan, adakah kita juga akan sekurang-kurangnya memperkasakan selain daripada  bahasa Malaysia, bahasa Inggeris supaya ia juga akan menjadi satu universal language supaya  anak-anak kita apabila berbanding dengan free market, ia akan lebih setaraf dan kompetitif dalam  hal ini.    Berkaitan dengan hal ini, saya hairan bahawa kita ada pelan, ada cadangan bahawa two  plus two.  Satu yang unik satu yang revolutionary. Adakah ini praktikal on the ground kerana ramai  di antara graduan yang sedia ada tidak ada kerja.  Apabila ada two plus two ramai di antara  mereka mungkin tidak dapat tempat untuk menjalankan tugas atau pelajaran mereka.  Apa usaha  dan apa guarantee yang kerajaan boleh beri supaya apa yang diniatkan oleh kerajaan, dapat  diimplementasikan dengan sebagus-bagusnya.  Terima kasih.  >>**IMOKMANDato’ Seri Haji Idris Jusoh:  Terima kasih Yang Berhormat.  Sebenarnya memang kalau  kita lihat di dalam pelaksanaan Pelan Pembangunan Pendidikan ini bahasa Inggeris memang  diberi penekanan.  Bukan hanya di peringkat universiti, tetapi juga di peringkat sekolah lagi.  Sebab  itu program pemerkasaan bahasa Inggeris sebenarnya di sekolah kita ada beberapa program.   Antaranya ialah kita akan melatih sehingga akhir tahun ini 22,500 guru-guru bahasa Inggeris untuk \n\n","weightedVote":"2.5","numVotes":"0","author":"leowmjw","community":"1","dateAdded":"2015-08-24","pattern":"(\\s+.+?|\\*\\*IMOKMAN)(.+?)(>>|$)","replace":" $2\\n\\n\\n","state":"{\"substEnabled\":true}"}