{
  "author" : null,
  "content" : "Whilst the issues of jurisdiction, choice of law,and territorial scope describedabove are conceptually distinct, courts do not always refer to them in thisway. It is very common in employment cases for the term 'jurisdiction' tobe used in what are, in fact, three quite different contexts. First, to describeinternational jurisdiction. Secondly, in relation to domestic jurisdiction.But thirdly, confusingly, tribunals wil often refer to the issue of territorial scope in terms of jurisdiction: but it is not jurisdiction in either of the nor-mal private international law senses of the word described above.17 A tribunal will often say, once it has determined that someone comes withinthe territorial scope of the relevant provision, that it has 'jurisdiction'meaning it can go on to decide whether the claim is established on themerits. In practice, the international and domestic jurisdictional rules willusually be satisfied if the employee falls within the territorial scope of thelegislation.18 However, the distinction between the territorial scope of aright and the tribunal's domestic and international jurisdiction is an impor-tant one and eliding or appearing to elide the two can lead to confusion.19.ASD.Once the distinction between international jurisdiction and territorial scopeis appreciated it is clear that the fact that a tribunal has international anddomestic jurisdiction to hear a claim does not mean that the claimant willnecessarily fall within the scope of the substantive right. It simply mean:sthat procedurally the tribunal can potentially hear the claim; it does notmean that there is no need to satisfy any personal or temporal requirements,such as the definition of employee or a qualifying period. The same mustalso be true of the territorial limits, if any, to a particular right. TheEmployment Appeal Tribunal (EAT) correctly distinguished between thedifferent uses of the term jurisdiction in Financial Times Limited v Bishop.20The claimant was attempting to bring a claim for unfair dismissal against hisemployer who was domiciled in England. The Brussels I Regulation rulesapplied, and the claimant could rely on Article 19(1) Brussels I Regulation tofound international jurisdiction.21 However, HH J Burke QC noted:Article 19, as we see it, does not give us any indication as to the extent, if any, ofthe extra-territorial effect of section 94 of the ERA [the right not to be unfairly dis-missedl; it tells us only where, if a right under section 94 exists, it can be pursued We do not believe that [the claimant] can found jurisdiction on Article 19; andto the extent that the Tribunal took a different view they were, in our judgment,in error.22",
  "numVotes" : 0,
  "id" : 0,
  "weightedVote" : 0,
  "replace" : "\/n\/r",
  "pattern" : "(.)",
  "sha" : null,
  "description" : "capture group",
  "name" : ""
}