{"id":"164578","urlID":"3ajr6","name":"match font-size tags","description":"","content":"<h2><img src=\"images\/phyllis.jpg\" border=\"0\" hspace=\"5\" vspace=\"5\" width=\"100\" height=\"85\" align=\"left\" \/><em>Libyan protesters asked for help, but the military attacks  they're getting may actually create a whole new set of problems that  could last a very long time.<\/em><\/h2><br \/><div> \t\t\t\t\t\t<p>The United States and its allies launched the war against Libya  on the eighth anniversary of the 2003 invasion of Iraq. President  Barack Obama says the U.S. will transfer command authority very soon,  that military action should be over in \"days, not weeks,\" and that he  wants no boots on the ground. But the parallels with other U.S. wars in  the Middle East don't bode well.<\/p> <p>The Pentagon may indeed transfer its command to some other military  leadership. But what happens when London and Paris decide they don't  have sufficient weaponry, or can't afford it any longer--what will  President Obama do then? And what about that \"no U.S. troops on the  ground\" line? Forget about it. When the first F-15 warplane went down on  Sunday, one of the airmen was picked up by Libyan opposition supporters  and turned over to unidentified \"U.S. forces\"--who must have been on  the ground as part of a rescue arrangement.<\/p> <p>The people of Libya, like those in neighboring countries who also  rose up to challenge brutal dictatorships, are paying a huge price for  their resistance. Unlike the others, the Libyan uprising quickly became  an armed battle, with Gaddafi's side far more powerful. The need to  support the out-gunned protesters was very real.<\/p> <p>Libyan activists themselves said they wanted intervention by the  international community. But what they got may have far different  results than they sought. Despite their exultation over the first  destroyed tanks, questions loom. The United Nations' intent is to  protect civilians from those tanks. But according to <em>The<\/em> <em>New York Times<\/em>,  \"many of the tanks seemed to have been retreating\"--just what the UN  resolution required. That happened in 1991, too, when a column of  retreating Iraqi tanks and troops leaving Kuwait was attacked by U.S.  warplanes whose pilots called it \"a turkey shoot.\"<\/p> <p>Why do we think another U.S.-led western attack against another  Middle Eastern country will lead to democracy? What's the end game? What  if a stalemate leaves Libya divided, with military attacks continuing?  The UN resolution is very clear that military force can only be used to  protect Libyan civilians, but the Western powers have simultaneously  made clear that their real political goal is regime change--ousting  Muammar Gaddafi. Ironically, by stating Gaddafi has \"lost his  legitimacy,\" western leaders are dramatically narrowing the space for  negotiations which could provide for a more peaceful removal of the  Libyan leader. And what if these attacks lead to an escalating, rather  than diminishing, civil war?<\/p> <p>The Pentagon's official position is that U.S. military involvement in  Libya matches the UN resolution--we're only protecting civilians. How  will that work if air strikes continue against military targets that  happen to be located in the middle of Libyan cities? And how is anyone  supposed to believe that protecting civilians is really the Pentagon's  only goal when their Commander in Chief says Gaddafi must go?<\/p> <p>In Iraq, a protracted no-fly zone directl","weightedVote":"2.5","numVotes":"0","author":"","community":"1","dateAdded":"2015-03-13","pattern":"font-size.*?[xmt];*","replace":"","state":"{\"substEnabled\":false}"}