{"id":"144143","urlID":"38nvd","name":"mm.dd. Title<p>","description":"Title finder, adjust title length (22)","content":"06.06. Esztergom<p>Pontosan érkezett a busz. Jó fél órás séta után felértem a székesegyház mellé és benyitottam a Pázmány P. Kat. Egyetem hatalmas kapuján. A recepciós hölgy nagypn kedvesen fogadott adott kulcsokat és felküldött a másodikra. A 204-es szobát Kempelen Farkas tanári szobának hívják. Itt minden szobának neve is van! A szállás kb 40 m2, kétoldalt 5-5 ágy, és csak én egyedül! Az épület orosz kórházként működött a szociban, a rendszerváltás után pár évvel renoválták éveken át. Hát csodaszép lett! A folyosón első osztályú WC, afolyosókon márvány burkolat, a -1 szinten lehet zuhanyozni a személyzeti öltözöben. A lift a legmodernebb és szabad is használni!<p>Lecuccoltam, felvettem a lájtos cipömet (a bakancs igen meleg) é s irány a város. Legelőször egy hideg sör, ott a kiülősben megnézegettem hol és mit fogok felkeresni. A Mária Valéria híd felé gondoltam hogy indulok és majd onnan könyvem szerint javasolt útvonalon megyek nézegetni. Be is céloztam az irányt, aztán kicsit eltértem és egy szép téren lyukadtam ki, ahol egy Kagylós kút szépsége ragadott meg. Középen egynői alak egy óriási kagylóval és körülötte másik három, mind különböző. Nagyon kecsesek csak kár, hogy a víz nem szökött . Továbbsétálta és egy ferences templomhoz érve gondoltam: jóljöhet egy kis áldás így az út elején, bemegyek. Hát a portásasszony felvilágosított, hogy a templom arrébb van ez itt egy kollégium. De ha már itt vagyok, van egy kortárs festőnek egy szép kiállítása, érdemes megnézni. No jól van, olyan kedvesen invitáltak, megnézem, bár eléggé odzkodom a mai festők pingálmányaitól. És láss csodát: Karesznak (kárpáti Tamásnak ) a képeiből volt 3 teremben kiállitás! Ha nem velem történik alig hinném el.&nbsp;<\/p><p>Nagy boldogsággal a szivemben sétáltam ki a kis Duna-ág partjára. A hatalmas platánfák csendjében néztem a part mellett kikötött horgász hajókat (vagy lehet,hogy halászbárkák voltak?).&nbsp;<\/p><p>Elsétáltam a &nbsp;nem működő strand és élményfürdő mellett s vele szemben egy kecses hullámvonlu szálloda befejezetlen váza meredezik szürkén. Kár mindkettőért.&nbsp;<\/p><p>A hídnáltovább ballagtam , kövtkezett egy Erzsébetkirályné szbor meg szentháromság szobor. Aztán egy kisvendéglő előtt álldigáló kocsmáros eligazított, hogyan jutok fel legegyszrűbben a szállásomra vissza: a Macskalépcsőn. Ez egy régi jó meredek fárasztó lépcső, de pont a Szent István szoborhoz jutunk fel. Útközben csudaszép a kilátás a Dunára.<\/p><p>Aztán \"itthon\" megettem a szendimet, fürödtem és mostbefejezem az írást.<\/p><\/p>\n﻿06.07. Dobogókő<p>Fél6-kor ébredtem - magamtól! Tötyörgés és csomagolás után pont 7- kor indultam. Először a Szent Tamás hegyen lévő kálváriát másztam meg. Innen olyan kilátás nyílik a Bazilikára és azegész várpsra, mint Athenban a Lükabethosról az Akropolisra.&nbsp;<\/p><p>Megtaláltam a Temető utcát és elkezdtem felkapaszkodni a 404 m magas Vaskapuhoz. Ez eléggé fárasztó út volt, de megérte, mert a menedékház teraszáról az egész szlovák területeket is be lehetett látni sőt egy kávét is ihattam. A leereszkedés a völgybe nem volt egyszerű a szűk és meredek ösvényen viszont fárasztó. Aztán egy idő után már a sárga jelzést sem találtam. Kerültem","weightedVote":"2.5","numVotes":"0","author":"giny8i8","community":"1","dateAdded":"2014-04-21","pattern":"\/\\d\\d\\.\\d\\d\\..{1,22}(?=<p)\/g","replace":"<h1>$&<\/h1","state":""}