{"id":"150083","urlID":"399c9","name":"fuzzy_german_date_matching","description":"Matches a variety of German date formats at the end of a string","content":"ayr, Philipp; Scharnhorst, Andrea; Larsen, Birger; Schaer, Philipp; Mutschke, Peter (2014): Bibliometric-enhanced Information Retrieval. Amsterdam, Link Mutschke, Peter; Scharnhorst,\nAndrea; Guéret, Christophe; Mayr, Philipp; Hansen, Preben; Slavic, Aida (2014): Knowledge Maps and Information Retrieval (KMIR). workshop proposal accepted for Digital Libraries 2014. KMIR-workshop at Digital Libraries 2014. Köln Link Mutschke, Peter (2014): PIDs4SOM - Persistence of Scholarly Content on the Social Web. International Conference on Science 2.0. Hamburg, Mutschke, Peter (2014): ScholarLib: a framework for bidirectional coupling of social networking sites with scholarly portals. International Conference on Science 2.0. Hanburg, Mutschke, Peter (2013): Anomaly detection in centrality computations. XXXIII Sunbelt Social Networks Conference of the International Network for Social Network Analysis (INSNA). Hamburg, Mayr, Philipp; Mutschke, Peter (2013): Bibliometric-enhanced Retrieval Models for Big Scholarly Information Systems. IEEE BigData 2013, Workshop on Scholarly Big Data: Challenges and Ideas. Santa Clara, Mayr, Philipp; Schaer, Philipp; Mutschke, Peter; Scharnhorst, Andrea (2013): Combining bibliometrics and information retrieval. Workshop at ISSI 2013. Vienna, Link Mutschke, Peter (2013): Keynote \"Innovative Knowledge Technologies for the Social Sciences. \" Future Research Information Forum (FRIF), Korea Chamber of Commerce and Industry (KCCI). Seoul, Mutschke, Peter (2013): Innovative knowledge technologies for the social sciences (extended version). Gastvortrag bei KISTI (Korea Institute of Science and Technology Information). Daejeon, Wira-Alam, Andias; Saad, Farag; Mutschke, Peter (2013): Query expansion based on conceptual and contextual term relationships in Wikipedia. 13. Internationalen Symposiums für Informationswissenschaft (ISI 2013). Potsdam, Link Mutschke, Peter (2013): ScholarLib: ein Framework zur bidirektionalen Koppelung von Sozialen Netzwerken mit wissenschaftlichen Fachportalen. \"Science 2.0 in Bibliotheken\" der BIB-Landesgruppe Hamburg. Hamburg, Link Saad, Farag; Mathiak, Brigitte; Mutschke, Peter (2013): Supporting Literature Review by Searching, Visualizing and Navigating Related Papers. 3rd International Conference on Social Computing and Its Applications. Karlsruhe, Mutschke, Peter (2013): Wissenstechnologien in den Sozialwissenschaften. Europäische Akademie zur Erforschung und Beurteilung von Folgen wissenschaftlich-technischer Entwicklungen. Bad Neuenahr-Ahrweiler, Mutschke, Peter (2012): Forschungsdatenmanagement bei GESIS im Kontext von Social und Semantic Web. Zweiter Leibniz-Workshop zum Strategischen Forschungsverbund \"Science 2.0\". Berlin, Mutschke, Peter (2012): SOFISwiki. a Wiki based collection of research projects. SMWCon Fall 2012. Cologne, Link Thamm, Mark; Wandhöfer, Timo; Mutschke, Peter (2012): ScholarLib: ein Framework zur Koppelung von Sozialen Netzwerken mit wissenschaftlichen Fachportalen.. 64. Jahrestagung der DGI und 2. DGI-Konferenz, Social Media and Web Science – Das Web als Lebensraum. Düsseldorf, Mutschke, Peter (2012): Science 2.0 im Kontext sozialwissenschaftlicher Forschungsstrukturen - laufende Arbeiten bei GESIS. Erster Leibniz-Workshop zum Strategischen Forschungsverbund \"Science 2.0\". Berlin, Mayr, Philipp; Mutschke, Peter; Petras, Vivien; Schaer, Philipp; Sure-Vetter, York (2011): Applying science models for search. ISI 2011: 12. Internationales S","weightedVote":"2.5","numVotes":"0","author":"chiborg","community":"1","dateAdded":"2014-08-06","pattern":"(((\\d{2}\\.\\s*)?\\d{2}\\.?\\s*-\\s*)?(\\d{2}\\.\\s*)?(\\d{2}\\.?|Januar|Februar|M.+rz|April|Mai|Juni|Juli|August|September|Oktober|November|Dezember)\\s*|[WS]S (\\d{4}\/)?)?\\d{4}[.\\s]+$","replace":"","state":""}