{"id":"152856","urlID":"39hg8","name":"Links in document","description":"","content":"Claim Chart for Patent US 8,674,992 vs. Neebula\n\nClaim \nNeebula\nClaim 1\n1.1 A method, comprising: displaying a graph on a display screen, the graph including a plurality of nodes, each of the plurality of nodes representing a service of a plurality of services;\n\nServiceWatch by Neebula implements a method for displaying the health of IT services using a graphical display. The graph includes various nodes representing IT services. \n\nCitations 1 through 4 show that ServiceWatch displays information related to multiple IT services in a graphical representation. Each service is displayed as a color-coded tile in the graph. The size of the tile depicts the business priority of the service.\n\n\n\n\n\n\n\n\n\n\n\nCitation 1:\n\nSource: http:\/\/www.neebula.com\/it-incident-management-tool\/it-service-monitoring\/\nCitation 2: \n\nSource: http:\/\/www.neebula.com\/landing\/view-servicewatch-live-demo\/\n\n\n\n\n\nCitation 3: \n\nSource: Obtained from ServiceNow demo: http:\/\/www.neebula.com\/landing\/view-servicewatch-live-demo\/ \n\n\n\n\nCitation 4:\n\nSource: Obtained from ServiceNow demo;  http:\/\/www.neebula.com\/landing\/view-servicewatch-live-demo\/ \n\n1.2 determining a metric for each of a plurality of attributes associated with a service level agreement (SLA) for each of the plurality of services, the plurality of attributes including at least one SLA violation, a severity of the incident causing the SLA violation and an importance of the corresponding service; and\nServiceWatch by Neebula implements a method for determining a metric for a plurality of attributes associated with a service level agreement (SLA) for multiple IT services. \n\nCitations 1 through 3 show that the graph displays the health and SLA violation status of the IT services. Further, the size of boxes (representing IT services) in the graph varies to indicate varying business priorities or importance of the services. Hence, Servicewatch determines a metric for attributes, such as SLA violation, severity of the incident causing the SLA violation and importance of the service.\nCitation 1:\n\nSource: http:\/\/www.neebula.com\/it-incident-management-tool\/it-service-monitoring\/\n\nCitation 2: \n\nSource: Obtained from ServiceNow demo: http:\/\/www.neebula.com\/landing\/view-servicewatch-live-demo\/\n\n\n\n\nCitation 3: \n\nSource: Obtained from ServiceNow demo: http:\/\/www.neebula.com\/landing\/view-servicewatch-live-demo\/\n\nCitations 4 and 5 show that ServiceWatch implements a method for setting up SLA violation rules and denoting the violation and severity of the violation in a graphical representation using a color-coding scheme. For example the critical SLA violation is depicted using red color.\nCitation 4:\n\nSource: Obtained from ServiceNow demo: http:\/\/www.neebula.com\/landing\/view-servicewatch-live-demo\/\n\n\n\n\nCitation 5: \n\nSource: http:\/\/www.neebula.com\/landing\/view-servicewatch-live-demo\/\n\n\n\n\n1.3 displaying a spotlight with each of the nodes of the plurality of nodes, the spotlight including a plurality of characteristics, each of the plurality of characteristics corresponding to one of the attributes of the service of the plurality of services represented by the node, the displayed spotlight being graphically varied based on the determined metric such that,\nServiceWatch by Neebula displays a spotlight including multiple characteristics with each of the nodes or tiles. The characteristics correspond to one of the attributes of the service represented by the node. Th","weightedVote":"2.5","numVotes":"0","author":"sidvish","community":"1","dateAdded":"2014-09-19","pattern":"\/http[s]*:\/\/[a-zA-Z.\/?=_#-:0-9]*\/g","replace":"","state":""}