{"id":"153119","urlID":"39i8t","name":"full line with modal","description":"gets the full line if there is the word \"it\" in it. Any word would work, for instance, if you want to extract all sentences from a corpus with a particular word. ","content":"<DOC id=\"AFP_ENG_19960901.0002\" type=\"story\" >\n<TEXT>\n<P>\nSome would also like the chief executive to be chosen by universal\nsuffrage, something, as Beijing points out, that was never a\nconsideration for the string of British governors.\n<\/P>\n<P>\nHong Kong returns to Chinese rule on July 1, 1997, after more than 150\nyears as a British colony.\n<\/P>\n<\/TEXT>\n<\/DOC>\n<DOC id=\"AFP_ENG_19960901.0003\" type=\"story\" >\n<HEADLINE>\nEx-chiefs of blood product firm to be charged over HIV scandal: report \n<\/HEADLINE>\n<DATELINE>\nTOKYO, Sept 1 (AFP) \n<\/DATELINE>\n<TEXT>\n<P>\nJapanese prosecutors are expected to file charges against two former\npresidents of Japanese drug maker Green Cross Corp. over the nation's\nHIV blood product scandal, the Mainichi Shimbun said Sunday.\n<\/P>\n<P>\nThe Osaka District Prosecutor's Office has started a full\ninvestigation and is considering issuing warrants for Renzo\nMatsushita, 75, and Tadakazu Suyama, 68, former presidents of Japan's\ntop supplier of blood products, the newspaper said.\n<\/P>\n<P>\nMore than 400 hemophiliacs have died in Japan after being infected\nwith HIV from unheated blood products sold by five companies,\nincluding Green Cross, in early and mid-1980s.\n<\/P>\n<P>\nThe company has already been investigated on suspicion of professional\nnegligence over the sale of HIV-tainted products that caused Acquired\nImmune Deficiency Syndrome (AIDS) among hemophiliacs.\n<\/P>\n<P>\nProsecutors believe the two former presidents should have minimized\nthe risk of their company's tainted blood products causing HIV\ninfection by suspending their shipments, the paper said.\n<\/P>\n<P>\nBut both Matsushita and Suyama reportedly denied the allegations,\ntelling prosecutors they did not know about the risks.\n<\/P>\n<P>\nIn March, the health ministry and five pharmaceutical firms including\nGreen Cross reached a court-mediated settlement on compensation for\nsome 400 hemophiliacs who contracted AIDS through untreated blood\nproducts.\n<\/P>\n<P>\nLast Thursday, prosecutors arrested Takeshi Abe, former head of a\ngovernment-led task force on AIDS on suspicion of providing HIV-tained\nblood products for his hemophilia patient, who died of AIDS in 1991.\n<\/P>\n<P>\nIt was the first arrest in connection with the decade-long scandal,\ninvolving the drug industry and Japanese medical authorities, led by\nthe health and welfare ministry.\n<\/P>\n<P>\nLast week, prosecutors also raided offices of Nippon Zoki\nPharmaceutical Co., another importer of blood products, on suspicion\nof selling tainted blood products to Abe.\n<\/P>\n<\/TEXT>\n<\/DOC>\n<DOC id=\"AFP_ENG_19960901.0004\" type=\"story\" >\n<HEADLINE>\nMedia minister foreshadows major restructuring of Australian press by Jack Taylor \n<\/HEADLINE>\n<DATELINE>\nSYDNEY, Sept 1 (AFP) \n<\/DATELINE>\n<TEXT>\n<P>\nAustralia's media laws could be overhauled to allow the breakup of\nexisting newspaper groups like the Fairfax press under separate\nowners, Communications Minister Richard Alston said Sunday.\n<\/P>\n<P>\nA long-promised media ownership inquiry would look at cross-media\nownership laws restricting companies controlling a television station\nfrom simultaneously owning more than 15 percent of a major newspaper\nin the same market, he said.\n<\/P>\n<P>\nThe inquiry, for which a date is yet to be set, would also examine\nforeign ownership laws, barring overseas companies from owning more\nthan 15 percent of commer","weightedVote":"2.5","numVotes":"0","author":"aralluna","community":"1","dateAdded":"2014-09-23","pattern":"\/.*could.*\/g","replace":"","state":""}