{"id":"153486","urlID":"39jba","name":"Clear HTML tags","description":"Usefull for removing Script, Style, comments and <XXX>...<\/XXX> HTML tags from a text.","content":"<div class=\"center\">\n    <h1><span id=\"NOCWebsiteMainContent_QuickSearch_lblQuickSearchresultTitle\">Quick Search - Results<\/span><\/h1>\n    <a id=\"cont\" href=\"#\" class=\"hidelink\"><\/a>\n    <p>Keyword(s):  \"2171\"<\/p>\n    <h2>\n        <a name=\"cont\">2171&nbsp;Information systems analysts and consultants<\/a>\n    <\/h2>\n    Information systems analysts and consultants analyze systems requirements, develop and implement information systems development plans, policies and procedures, and provide advice on a wide range of information systems issues. They are employed in information technology consulting firms and in information technology units throughout the private and public sectors, or they may be self-employed.<br><br>\n    <h3>Example Titles<\/h3>\n    IT (information technology) consultant<br>\n    computer systems analyst<br>\n    informatics consultant<br>\n    informatics security analyst<br>\n    information systems business analyst<br>\n    information systems quality assurance analyst<br>\n    management information systems (MIS) analyst<br>\n    systems auditor<br>\n    systems consultant<br>\n    systems security analyst<br><br>\n    <a href=\"ViewAllTitlesQuickSearch.aspx?val=2&amp;val1=2171&amp;val65=2171\">View all titles<\/a><br><br>\n    <h3>Main duties<\/h3><br>\n    The following is a summary of the main duties for some occupations in this unit group:\n    <ul>\n        <li>Information systems business analysts and consultants confer with clients to identify and document requirements, conduct business and technical studies, design, develop, integrate and implement information systems business solutions, and provide advice on information systems strategy, policy, management, security and service delivery.<\/li>\n    <\/ul>\n    <ul>\n        <li>Systems security analysts confer with clients to identify and document requirements, assess physical and technical security risks to data, software and hardware, and develop policies, procedures and contingency plans to minimize the effects of security breaches.<\/li>\n    <\/ul>\n    <ul>\n        <li>Information systems quality assurance analysts develop and implement policies and procedures throughout the software development life cycle to maximize the efficiency, effectiveness and overall quality of software products and information systems.<\/li>\n    <\/ul>\n    <ul>\n        <li>Systems auditors conduct independent third-party reviews to assess quality assurance practices, software products and information systems.<\/li>\n    <\/ul><br>\n    <h3>Employment requirements<\/h3>\n    <ul>\n        <li>A bachelor's degree in computer science, computer systems engineering, software engineering, business administration or a related discipline <br>\n        <i>or<\/i><br>\n        Completion of a college program in computer science is usually required.<\/li>\n    <\/ul>\n<\/div>","weightedVote":"4.49481","numVotes":"21","author":"Goodspeed","community":"1","dateAdded":"2014-09-29","pattern":"\/(<script(\\s|\\S)*?<\\\/script>)|(<style(\\s|\\S)*?<\\\/style>)|(<!--(\\s|\\S)*?-->)|(<\\\/?(\\s|\\S)*?>)\/g","replace":"","state":""}