{"id":"157650","urlID":"39vhm","name":"Rss Feed substitution","description":"","content":"<item>\n\t\t\t<title>Estos son 6 alimentos que puedes cultivar desde la comodidad de tu hogar<\/title>\n\t\t\t<link>http:\/\/www.bewell.com.mx\/mundobewell\/item\/estos-son-6-alimentos-que-puedes-cultivar-desde-la-comodidad-de-tu-hogar<\/link>\n\t\t\t<guid>http:\/\/www.bewell.com.mx\/mundobewell\/item\/estos-son-6-alimentos-que-puedes-cultivar-desde-la-comodidad-de-tu-hogar<\/guid>\n\t\t\t<description><![CDATA[<div class=\"element element-textarea first\">\n\t<div><p><b><i>La jardinería, además de implicar tiempo y dedicación, representa un increíble apoyo ecológico y monetario que ofrece tanto satisfacción personal como salud.<\/i><\/b><\/p><div><br><\/div><\/div><div><p>La jardinería autosuficiente es una manera de conectarse con el medio ambiente, la naturaleza y con nosotros mismos. Esta actividad, además de implicar tiempo y dedicación, representa un increíble apoyo ecológico y monetario que ofrece tanto satisfacción personal como salud.&nbsp;<\/p><p><img src=\"http:\/\/www.bewell.com.mx\/images\/stories\/540-cultivaplantas.jpg\" mce_src=\"http:\/\/www.bewell.com.mx\/images\/stories\/540-cultivaplantas.jpg\" alt=\"\"><br><\/p><p><span style=\"line-height: 1.3em;\">En el caso que no sepas cuáles plantas son las ideales para plantar en tu jardín, te compartimos seis que podrán enverdecer tu hogar y enriquecer cada uno de los platillos de tu cocina.&nbsp;<\/span><\/p><p><span style=\"line-height: 1.3em;\"><b>Menta.<\/b> Esta planta cubre rápidamente varias partes del suelo, en especial aquellas partes que son húmedas. Por lo que es importante que te asegures que tenga límites para que no afecte el crecimiento de otras plantas. Existen diferentes tipos de menta, como la hierbabuena, menta verde, chocolate, menta de piña, etcétera. Puedes utilizarla para cocinar o para hacer un té frío o caliente.&nbsp;<\/span><\/p><p><span style=\"line-height: 1.3em;\"><b>Tomillo rastrero.<\/b> Además de ser una hierba culinaria increíble, el tomillo también enaltece la belleza de tu jardín, en especial en las áreas de los pasillos o donde haya un camino. Entre las variedades del tomillo, las hay aquellas que crecen hacia los lados (en vez de hacia arriba), por lo que son ideales para cubrir de verde a tu jardín.<\/span><\/p><p><span style=\"line-height: 1.3em;\"><b>Fresa alpina.<\/b> Este tipo de fresa, con un sabor y fragancia inigualable, es delicada por lo que tienes que ofrecerle cuidados específicos. Para recibir sus deliciosos frutos, estas plantas son ideales en áreas limitadas.&nbsp;<\/span><\/p><p><span style=\"line-height: 1.3em;\"><b>Romero rastrero.<\/b> Esta planta es popular para sus usos gastronómicos, sin embargo no todos sus estilos se adecúan al hábitat de un jardín. El tomillo rastrero es ideal para los patios (aún en las regiones áridas), ya que es resistente y con potencial para cubrir todas las áreas. Necesita mucho sol.&nbsp;<\/span><\/p><p><span style=\"line-height: 1.3em;\"><b>Axocopaque o gaulteria.<\/b> Tanto las hojas como las bayas rojas de esta planta cuentan con un sabor único, el cual puede usarse en tés o algunos platillos. Crecen, lentamente, en ambientes con sombra.&nbsp;<\/span><\/p><p><span style=\"line-height: 1.3em;\"><b>Orégano.<\/b> Además de ser una hierba culinaria, el orégano también ayuda a enverdecer el jardín. Forma parte de la familia de la menta, y en ocasiones se le conoce como mejorana salvaje. Es recomendable plantarlo en áreas con mucho sol y suelo seco (es una de las pla","weightedVote":"2.5","numVotes":"0","author":"","community":"1","dateAdded":"2014-11-26","pattern":"\/<div class=\"element element-image last\">\\n\t<img src=\"([A-Za-z0-9\\:\\\/\\.\\_\\-]+)\" alt=\"([\\w\\s\\á\\é\\í\\ó\\ú\\ñ\\“\\”]+)\" width=\"([0-9]+)\" height=\"([0-9]+)\" \/><\/div>\/g","replace":"","state":""}