{"id":"160956","urlID":"3a97k","name":"Pubmed ID","description":"","content":"\n PMID:9094314 \n  \n  \n  PMID:9895304,12840507 PMID:10985776,9895304,9094314,\n17383196--MTOR phosphorylates in the serine residue of AKT PMID: 16469695, 16900391,\nhttp:\/\/stke.sciencemag.org\/cgi\/reprint\/sigtrans;2\/67\/pe24.pdf PMID: 12172554 PMID: 15854902,17383196 PMID: 11741833 PMID: 10200280, 9873003 PMID:17917066 PMID: 16603397--Rapamycin has a target for mTORC2 in T cells\n\n\nPMID:19285553,\n\nhttp:\/\/stke.sciencemag.org\/cgi\/reprint\/sigtrans;2\/67\/pe24.pdf\n\nPMID 18030348\nPRR5L binds specifically to mTORC2, via Rictor and\/or SIN1. Unlike other mTORC2 members, PRR5L is not required for mTORC2 integrity or kinase activity, but dissociates from mTORC2 upon knock down of tuberous sclerosis complex 1 (TSC1) and TSC2.\n\nPMID 16226444\nAs the rictor–mTOR complex cannot bind FKBP12– rapamycin, it is unlikely to mediate mTOR functions discovered through their sensitivity to acute treatment with the drug. The surprising finding that rictor–mTOR, instead of raptor –mTOR, is the hydrophobic motif kinase of a rapamycin-resistant mutant of S6K1 was critical to discovering a bona fide substrate for rictor–mTOR PMID:12840507 PMID: 12466966, PMID 16226444\nThe mammalian TOR (mTOR) pathway is a key regulator of cell growth and proliferation and increasing evidence suggests that its deregulation is associated with human diseases, including cancer and diabetes. The mTOR pathway integrates signals from nutrients, energy status and growth factors to regulate many processes, including autophagy, ribosome biogenesis and metabolism. Recent work identifying two structurally and functionally distinct mTOR-containing multiprotein complexes and TSC1\/2, rheb, and AMPK as upstream regulators of mTOR is beginning to reveal how mTOR can sense diverse signals and produce a myriad of responses. PMID: 12466966, PMID 16226444\nThe mammalian TOR (mTOR) pathway is a key regulator of cell growth and proliferation and increasing evidence suggests that its deregulation is associated with human diseases, including cancer and diabetes. The mTOR pathway integrates signals from nutrients, energy status and growth factors to regulate many processes, including autophagy, ribosome biogenesis and metabolism. Recent work identifying two structurally and functionally distinct mTOR-containing multiprotein complexes and TSC1\/2, rheb, and AMPK as upstream regulators of mTOR is beginning to reveal how mTOR can sense diverse signals and produce a myriad of responses. PMID:2167854,17917066 PMID: 10200280 PMID: 10364159 PMID: 9710582 \n\nPMID: 9811607\nPKC is RHO1 effector.\nPMID: 16226444\n\nPMID 12408816\nTOR2 signals to the actin cytoskeleton by activating a Rho-type GTPase switch. More specifically, TOR2 activates the GDP\/GTP exchange factor (GEF) ROM2. ROM2 in turn converts RHO1 and RHO2 to an active, GTP-bound state. GTP-bound RHO binds and activates PKC1 which then signals to the actin cytoskeleton via a MAP kinase cascade composed of BCK1, MKK1, and MPK1\/SLT2.\n\nPMID 16226444\nThe mammalian TOR (mTOR) pathway is a key regulator of cell growth and proliferation and increasing evidence suggests that its deregulation is associated with human diseases, including cancer and diabetes. The mTOR pathway integrates signals from nutrients, energy status and growth factors to regulate many processes, including autophagy, ribosome biogenesis and metabolism. Recent work identifying two structurally and functionally distinct mTOR-containing multiprotein complexes and TSC1\/2, rheb","weightedVote":"2.7449","numVotes":"2","author":"Susheee","community":"1","dateAdded":"2015-01-23","pattern":"\/PMID.+[0-9]{1,9}[\\S]\/gm","replace":"","state":""}