{"id":"163626","urlID":"3ah1u","name":"DR1","description":"dragonrealms healing expression","content":"Insignificant (touch)\tlight scratches\tslight discoloration\tslightly tender\tminor internal scarring\nInsignificant (look)\tfaint scuffing to the head\tsome faint scars along the head\t-\t-\nInsignificant (health)\tminor abrasions to the head\ta few nearly invisible scars along the head\t-\t-\nNegligible (touch)\tlight scratches\tslight discoloration\tslightly tender\tminor internal scarring\nNegligible (look\/health)\ttiny scratches to the head\tsome tiny scars across the head\t-\t-\nMinor \/ More than Minor\tcuts and bruises about the head\tminor scars about the head\ta bruised head\tan occasional twitch on the forehead\nHarmful \/ Very harmful\tsome moderately deep cuts about the head\tsevere scarring about the head\ta deeply bruised head\tan occasional twitch on the forehead\nDamaging \/ Very damaging\tsome deep slashes and cuts about the head\tsevere scarring and ugly gashes about the head\tmajor swelling and bruising around the head\tan occasional twitch on the forehead\nSevere \/ Very severe\ta cracked skull with deep slashes\tmissing chunks out of the head\ta ghastly bloated head with bleeding from the ears\ta confused look with sporadic twitching of the forehead\nDevastating \/ Very Devastating\ta crushed skull with horrendous wounds\ta mangled and malformed head\ta ghastly bloated head with bleeding from the ears\ta confused look with sporadic twitching of the forehead\nUseless\tA pulpy stump for a head\ta stump for a head\ta grotesquely bloated head with bleeding from the eyes and ears\ta blank stare\n\nou have some minor abrasions to the right leg, an occasional twitching in the left leg, some minor abrasions to the left eye, a bruised, swollen and bleeding left eye, a bruised, swollen and slashed left eye, a bruised and swollen left eye, a bruised and swollen left eye, some minor twitching, general numbness all over.\nan slight discoloration of the left eye, some faint scars along the left eye, an occasional twitching in the left eye, an occasional twitching in the left eye, severe scarring across the left eye, a punctured and shriveled left eye, a painfully mangled and malformed left eye in a shattered eye socket, a few nearly invisible scars along the left eye, some minor twitching, general numbness all over, a severely swollen, bruised and blind left eye. some minor swelling and bruising around the left eye. a cracked skull with deep slashes.","weightedVote":"2.5","numVotes":"0","author":"IPJ","community":"1","dateAdded":"2015-02-27","pattern":"\/(slight|some faint|a few|some tiny|minor scars|severe|deeply scarred|a punctured|a painfully|an empty).+(left eye)\\,\/i","replace":"","state":"{\"substEnabled\":false}"}