{"id":"167730","urlID":"3at2m","name":"3at2b","description":"","content":"UNITED STATES\nSECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549\nFORM 8- K CURRENT REPORT\nPURSUANT TO SECTION 13 OR 15(d) OF\nTHE SECURITIES EXCHANGE ACT OF 1934\nDate of report (Date of earliest event reported):  May 5, 2011 Energy XXI (Bermuda) Limited\n(Exact name of registrant as specified in its charter) 001- 33628\n(Commission File Number)\nBermuda 98- 0499286\n(State or other jurisdiction of incorporation or organization) (I.R.S. Employer Identification No.)\nCanon€s Court, 22 Victoria Street, PO Box HM 1179, Hamilton HM EX, Bermuda Not Applicable\n(Address of principal executive offices) (Zip Code)\nRegistrant's telephone number, including area code: 441- 295- 2244\nCheck the appropriate box below if the Form 8- K filing is intended to simultaneously satisfy the filing obligation of the registrant under any of the\nfollowing provisions:\nq Written communications pursuant to Rule 425 under the Securities Act (17 CFR 230.425)\nq Soliciting material pursuant to Rule 14a- 12 under the Exchange Act (17 CFR 240.14a- 12)\nq Pre- commencement communications pursuant to Rule 14d- 2(b) under the Exchange Act (17 CFR 240.14d- 2 (b))\nq Pre- commencement communications pursuant to Rule 13e- 4(c) under the Exchange Act (17 CFR 240.13e- 4 (c))\n\nItem 1.01.  Entry into a Material Definitive Agreement\nOn May 5, 2011, Energy XXI (Bermuda) Limited€s indirect wholly owned subsidiary Energy XXI Gulf Coast, Inc. (Gulf Coast‚) entered into a\nSecond Amended and Restated First Lien Credit Agreement (the First Lien Credit Agreement‚) with various financial institutions and The Royal\nBank of Scotland plc, as administrative agent.  The First Lien Credit Agreement amended and restated Gulf Coast€s pre- existing Amended and\nRestated First Lien Credit Agreement.  In general, the First Lien Credit Agreement incorporated the ongoing relevant terms from prior amendments\nto the pre- existing version of the agreement, deleted concepts that are no longer applicable or necessary to be included in a current version of the\nagreement and made other modifications to the pre- existing version of the agreement, including:\n· increasing the current borrowing base under the First Lien Credit Agreement to $750 million (from $700 million);\n· reducing the applicable margins for interest rates under the First Lien Credit Agreement for borrowings based on the London Interbank\nOffered Rate to 2.25 percent to 3.00 percent (such reductions from 2.75 percent to 3.50 percent, respectively) and borrowings on an\nalternate base rate (based on the federal funds effective rate) to 1.25 percent to 2.00 percent (such reductions from 1.75 percent to 2.50\npercent, respectively);\n· deleting references to Gulf Coast€s former second lien debt, which was fully retired earlier this year, and commensurately removing the financial\ncovenant regarding our secured debt ratio;\n· establishing a further general basket of permitted unsecured indebtedness of $250 million (less the principal amount of Gulf Coast€s 10%\nsenior notes due 2013 that remain outstanding at the time of incurrence of any such debt);\n· incorporating a pre- approval in regards to a sale of onshore assets of Gulf Coast and its subsidiaries;\n· increasing to $17 million (from $9 million) the amount of permitted annual restricted payments that Gulf Coast and its subsidiaries may\nmake to their parent entities and, ultimately, to Energy XXI (Bermuda) Limited so that Energy XXI (Bermuda) Lim","weightedVote":"2.5","numVotes":"0","author":"","community":"1","dateAdded":"2015-04-27","pattern":"(^[A-Z0-9].+?)((?:means|is\\sdefined)([\\s\\S]*?)(?=\\.\\n))","replace":"","state":"{\"substEnabled\":false}"}