{"id":"168536","urlID":"3ave8","name":"Markdown Line Break Override","description":"This adds two spaces at the end of every line, overriding Markdown's annoying paragraph concatenation feature.","content":"I fucking hate all of you for making me waste my time.\n\nAfter graduating from university, I still was a virgin. Some of my ex-classmates I was kinda close with kept bugging me about my \"distant, cold and aloof personality\". They don't understand it's plain boring to spend your time with people who are majoring on computer engineering, yet still don't know how to install a Linux distro or make a basic IRC client in C. Because of this, interaction between us consisted of calling me whenever they wanted to play a multiplayer game or had a problem with their pirated software running on shitty hardware. Telling them outright to fuck off wasn't a good idea because university forces you to do group homework and making enemies is never a good idea, no matter where you are.\n\nNow for the relevant part. Since we all grew out of university and went on with our lives, many of them followed the usual trend of getting a job, buying a car, finding a girlfriend and becoming utterly bitter faggots. One of my ex-classmates called me, said he's wondering how I've been doing and invited me over to his place. Trying not to be an asshole, I accepted his invitation and had a long conversation while we were having lunch. The lunch his girlfriend had prepared for all three of us.\n\nHim: \"How's life going for you?\"\nMe: \"Got a job for a small company that works with embedded devices. Been writing some simple drivers and helping them with their Linux servers and stuff because they don't have any sysadmins yet. What about you?\"\nH: \"Found a job at a company that makes software for other bigger companies. It's been pretty hard on me but I'm doing this for the both of us.\"\n(starts staring at his girlfriend, she giggles and they kiss)\nH: \"I suppose you already found someone to give meaning to your life.\"\n(first thought that comes to my head is that of my favorite Touhou, then I realize how gay he sounds)\nM: \"No, you know I'm not the kind of person to spend my time with others.\"\nH: \"Awww! Come on, aren't you a bit too old for that?\"\n(girlfriend agrees with a quick nod and a \"Yeah, yeah\")\nH: I bet you still live alon- don't tell me you are still single!\"\nM: \"Well, yeah. Time and money are virtually unlimited, there's nothing to complain about this lifestyle.\"\n(girlfriend looks mildly offended)\nH: \"You wouldn't understand! You've never had someone to share your days with.\"\n(Is that my fault? I consider myself an unintelligent dumbfuck and finding people who are mildly interesting is pretty fucking hard. Also, what kind of brainwashing have you been through? What's with those awfully cheesy sayings?)\nM: \"Of course not, I'm considerate enough not to bore other people to death with my endless ramblings about computers.\"\nH: \"Haha, don't say that, I'm pretty sure there's someone out there for you.\"\nM: \"I'm not trying to be mean, but I'm real fucking sick of that line. How many times have I told you I don't find permanent company enjoyable? Living alone and having all the time I want for myself is what I've always wanted ever since I was very young and I'm not giving it up after I've come this far.\"\nH: \"You're saying that because you're feeling lonely. Don't worry, it's not that uncommon to rationalize your situation, especially at your age. Believe me, you wouldn't want to go bac","weightedVote":"3.26389","numVotes":"1","author":"antonizoon","community":"1","dateAdded":"2015-05-08","pattern":"\/(.+)\/g","replace":"$1  ","state":"{\"substEnabled\":true}"}