{"id":"168924","urlID":"3b0ik","name":"UTF-8 Words","description":"Selects words by excluding a wide range of non-letters","content":"Die Gefährten erzählt zunächst die Vorgeschichte des sogenannten Einen Rings, der von dem Dunklen Herrscher Sauron geschmiedet wurde. Der Ring besitzt magische Kräfte und verleiht Sauron große Macht. Trotzdem gelang es den freien Völkern Mittelerdes, Sauron zu bezwingen. Isildur nahm den Einen Ring an sich, wurde aber durch einen Überfall von Orks getötet. Zweitausend Jahre später, als der Ring schon fast in Vergessenheit geraten war, fand ihn Smeagol, ein Halbling, der durch den Ring zur Kreatur Gollum wurde. Der Ring verfluchte das Leben der Kreatur fünfhundert Jahre lang, bis er sich auf die Suche nach einem neuen Träger machte und so dem Hobbit Bilbo Beutlin in die Hände fiel. Die eigentliche Handlung beginnt nun – 60 Jahre später – im Auenland. Bilbo entschließt sich an seinem 111. Geburtstag, von dort fortzugehen und seinem Neffen Frodo Beutlin den Ring zu vermachen. Durch das Studium alter Aufzeichnungen findet der Zauberer Gandalf heraus, dass es sich bei diesem um den Ring des dunklen Herrschers Sauron handelt. Sauron, der in sein altes Reich Mordor zurückgekehrt ist, lässt seine Diener, die Nazgûl, nach dem Ring suchen, durch den er seine alte Stärke wiedererlangen würde. Frodo muss daher aus seiner Heimat fliehen. Seine Freunde Samweis Gamdschie, Meriadoc Brandybock und Peregrin Tuk schließen sich ihm nacheinander an. Sie flüchten vor ihren Verfolgern, den Nazgul, nach Bree, wo ein Treffen mit Gandalf verabredet war. Dieser erscheint nicht, da er von seinem einstmaligen Freund, nun aber Verbündeter Saurons, Saruman, der Weise, in dessen Heimat Isengard festgehalten wird. Stattdessen treffen die Hobbits in Bree auf Aragorn, den rechtmäßigen Erben des Throns von Gondor. Dessen Identität jedoch bleibt zunächst verborgen, da er sich als „Streicher“ ausgibt. Er will sie in die Elbenstadt Bruchtal führen. Auf der Reise dorthin wird Frodo bei einem Angriff der Nazgûl schwer verletzt. Durch die Hilfe der Elbin Arwen gelangt er noch rechtzeitig nach Bruchtal, um von Elrond geheilt zu werden. In Bruchtal entscheidet ein Rat aus Vertretern der freien Völker Mittelerdes, dass eine Gemeinschaft von neun Gefährten den Ring nach Mordor bringen soll, um ihn dort zu vernichten. Die Gemeinschaft besteht aus Gandalf, Aragorn, den Hobbits Frodo, Sam, Pippin und Merry, dem Menschen Boromir, dem Elb Legolas und dem Zwerg Gimli. Auf dem Weg nach Mordor müssen die Gefährten das Nebelgebirge überwinden. Der Versuch, dieses am Berg Caradhras zu überqueren, scheitert an einem von Saruman ausgelösten Schneesturm. Deshalb beschließen sie, einen Umweg durch die Minen von Moria zu nehmen. Dort finden sie die Leichen der dort einst lebenden Zwerge vor. Außerdem kommt es zu einem Kampf mit einigen Orks und einem Höhlentroll. Schließlich taucht ein Balrog auf, ein Dämon aus der Unterwelt, der einst von den Zwergen bei ihrem Schürfen nach Mithril aufgescheucht wurde und deren Reich in Moria schließlich vernichtete. Die Gefährten ergreifen vor ihm die Flucht. Gandalf will den Balrog auf der Brücke von Khazad-dûm aufhalten. Beide stürzen zusammen in eine Schlucht und seine Gefährten müssen die Reise ohne ihn fortsetzen. Sie erreichen das Elbenreich Lórien, das von Galadriel und Celeborn regiert wird. Dort schaut Frodo in Galadriels Spiegel und erkennt die Gefahren, die noch vor ihm liegen. Er bietet Galadriel den Ring an, die – selber Ringträgerin – diesem Angebot widerstehen kann. Galadriel überreic","weightedVote":"3.72449","numVotes":"2","author":"Gustavo Spredemann","community":"1","dateAdded":"2015-05-14","pattern":"\/([^\\u0000-\\u0040\\u005B-\\u0060\\u007B-\\u00BF\\u02B0-\\u036F\\u00D7\\u00F7\\u2000-\\u2BFF])+\/g","replace":"","state":"{\"substEnabled\":false}"}