{"id":"168945","urlID":"3b0kj","name":"Select UTF-8 Punctuation","description":"Selects a wide range of punctuation (skips apostrophes for english's sake).","content":"1 00:00:28,831 --> 00:00:32,927 Forget it. It's too risky. I'm through doing that shit. 2 00:00:33,002 --> 00:00:36,460 You always say that. The same thing every time. 3 00:00:36,539 --> 00:00:38,473 \"l'm through, never again, too dangerous.\"4 00:00:38,541 --> 00:00:41,032 I know that's what I always say. I'm always right too. 5 00:00:41,110 --> 00:00:44,511 - You forget about it in a day or two. - The days of me forgetting are over. 6 00:00:44,580 --> 00:00:46,673 The days of me remembering have just begun. 7 00:00:46,749 --> 00:00:48,910 You know, when you go on like this, what you sound like? 8 00:00:48,985 --> 00:00:52,011 - I sound like a sensible fuckin' man. - You sound like a duck. 9 00:00:52,088 --> 00:00:55,546 - Quack, quack, quack. - Take heart, 'cause you're never gonna have to hear it again. 10 00:00:55,625 --> 00:00:59,117 Since I'm never gonna do it again, you're never gonna have to hear me quack. 11 00:00:59,195 --> 00:01:03,928 - After tonight? - Correct. I got all tonight to quack. 12 00:01:04,000 --> 00:01:06,833 - Can I get anyone more coffee? - Oh, yes! 13 00:01:08,638 --> 00:01:11,198 - Thank you. - You're welcome. 14 00:01:11,274 --> 00:01:14,368 I mean, the way it is now, 15 00:01:14,444 --> 00:01:17,242 you're takin' the same risk as when you rob a bank. 16 00:01:17,313 --> 00:01:19,372 Takin' more of a risk. Banks are easier. 17 00:01:19,449 --> 00:01:22,475 Federal banks ain't supposed to stop you in any way during a robbery. 18 00:01:22,552 --> 00:01:26,784 They're insured. Why should they give a fuck? I don't even need a gun in a Federal bank. 19 00:01:26,856 --> 00:01:30,314 Heard about this one bloke, he walks into a bank with a portable phone. 20 00:01:30,393 --> 00:01:33,362 He gives the phone to a teller. The bloke on the other end says, 21 00:01:33,429 --> 00:01:36,990 \"We got this guy's little girl. If you don't give him all your money, we're gonna kill her.\"22 00:01:37,066 --> 00:01:39,864 - Did it work? - Fuckin' right it worked. That's what I'm talkin' about. 23 00:01:39,936 --> 00:01:45,772 Knucklehead walks into a bank with a telephone. Not a pistol, not a shotgun, a fuckin' phone. 24 00:01:45,842 --> 00:01:50,472 - Cleans the place out. They don't lift a fuckin' finger. - Did they hurt the little girl? 25 00:01:50,546 --> 00:01:54,243 There probably never was a little girl. The point of the story isn't a little girl. 26 00:01:54,317 --> 00:01:57,309 The point of the story is they robbed a bank with a telephone. 27 00:01:57,387 --> 00:02:00,356 - You want to rob banks? - I'm not saying I wanna rob banks. 28 00:02:00,423 --> 00:02:02,857 I'm illustrating if we did, it'd be easier than what we've been doing. 29 00:02:02,925 --> 00:02:07,089 -No more liquor stores? -What've we been talkin' about? Yeah, no more liquor stores. 30 00:02:07,163 --> 00:02:10,132 Besides, it ain't the giggle it used to be. There's too many foreigners own liquor stores. 31 00:02:10,199 --> 00:02:12,133 Vietnamese, Koreans, don't even speak fuckin' English. 32 00:02:12,201 --> 00:02:14,567 You tell 'em empty out the register, they don't know what you're talkin' about. 33 00:02:14,637 --> 00:02:16,571 They make it too personal. 34 00:02:16,639 --> 00:02:20,871 - We keep on, one of these gook fuckers gonna make us kill him. - I'm not gonna kill anybody. 35 00:02:20,943 --> 00:02:25,243 ","weightedVote":"2.5","numVotes":"0","author":"Gustavo Spredemann","community":"1","dateAdded":"2015-05-14","pattern":"\/([\\u0000-\\u0026\\u0028-\\u0040\\u005B-\\u0060\\u007B-\\u00BF\\u02B0-\\u036F\\u00D7\\u00F7\\u2000-\\u2BFF])+\/g","replace":" ","state":"{\"substEnabled\":true}"}