{"id":"171271","urlID":"3b7el","name":"Mike's find","description":"This shows the prevalence of unneccasary HTML throughout the site","content":"<a href=\"http:\/\/themonastery.org\/images\/blog\/burqa.jpg\"><img style=\"float: left; margin: 0 10px 10px 0; cursor: hand; width: 240px; height: 320px;\" src=\"http:\/\/themonastery.org\/images\/blog\/burqa.jpg\" alt=\"Muslim woman wearing a burqa\" border=\"0\" \/><\/a>The struggle to preserve secular values is coming to a head in Europe, where a sudden surge in anti-fundamentalist Muslim sentiment has resulted in a crackdown on the full <span style=\"text-decoration: underline;\">Muslim veil<\/span>. Numerous jurisdictions across the continent have instituted or attempted to institute bans in an effort to stem what they see as a radical form of Islam which conflicts with the fundamental values of dignity and equality which European democracies stand for. Do these veil bans reflect a general fear of Islam, or a fear of a fundamentalist form of the religion which oppresses women? It seems to be a combination of both, but it is easy to understand the European apprehension towards the more radical elements of Islam.\n\nThe latest country to push ahead with a full veil ban is Belgium, where the Chamber of Representatives voted 29 April to pass a ban nationwide; the bill still needs Senate approval to become law. In France, which had already been mulling anti-veil legislation under President Nicolas Sarkozy's conservative government, the National Assembly overwhelmingly proclaimed full Muslim veils as \"contrary to the values of the republic\", in what lawmakers explained as a step toward a ban like Belgium's. Similar anti-veil legislation has been proposed in the Dutch and Italian parliaments, reflecting the strong overall resurgence of European <a href=\"http:\/\/www.themonastery.org\/jcontent\/training\/12-guide-to-divinity\/107-humanism?template=themonastery\" target=\"_blank\"><span style=\"text-decoration: underline;\">secular humanism<\/span><\/a> in light of a perceived onslaught of religious fundamentalism.\n\nBut while the governments of France and Belgium are still attempting to pass such legislation, several local European jurisdictions have already succeeded in doing so, or in banning other symbols of Islam. Last November, the construction of <span style=\"text-decoration: underline;\">minarets<\/span> was banned in Switzerland, and Swiss Justice Minister Eveline Widmer-Schlumpf revealed that the Swiss government is planning a full veil ban as well (although, ironically, the rule will exempt wealthy Persian Gulf tourists, who spend a great deal in Swiss hotels and luxury shops). Meanwhile, in Novara, Italy, a Tunisian immigrant was fined $650 for wearing a veil on her way to a mosque.\n\nOne Muslim Belgian woman, who goes by the name Selma, argues that the proposed bans reflect a form of Islamophobia, especially since the vast majority of European Muslim women do not wear the full veil. It is easy to see how the Swiss minaret ban, which targets an architectural feature and not an actual form of oppression, could ironically constitute a form of oppression itself, and many liberals discouraged its passage. But maybe Europeans have good reason to fear <a href=\"http:\/\/www.themonastery.org\/catalog\/whatdoesislamsay-p-202.html\" target=\"_blank\"><span style=\"text-decoration: underline;\">radical Islam<\/span><\/a>: after the Chamber approved the bill, a video was posted on the Internet threatening attacks on Belgium. It is such a propensity for violence which drives the fear of radical Islam","weightedVote":"2.5","numVotes":"0","author":"Michael Chriatenaen","community":"1","dateAdded":"2015-06-16","pattern":"\/><span style=\"text-decoration: underline;\">(.)*<\/span><\/a>\/g","replace":"","state":"{\"substEnabled\":false}"}