{"id":"173802","urlID":"3beru","name":"brightsolid","description":"","content":"<!-- [vc_row][vc_column width=\"1\/1\"][vc_column_text]\n<h2>Cloud Whitepaper<\/h2>\nDownload our 7 critical cloud strategy considerations and learn:\n<ul>\n\t<li>Key considerations cloud customers need to be aware of when developing or reviewing their digital strategy<\/li>\n\t<li>How to invest confidently in cloud<\/li>\n\t<li>What our cloud philosophy is and how we set about building our clouds<\/li>\n<\/ul>\n[download_white_paper file_name=\"brightsolid-Aberdeen-Data-Centre-Flyer.pdf\" unique_id=\"Aberdeen-Data-Centre-Flyer\" ga_code=\"alert('this is a test');\"][\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]\n[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column width=\"1\/1\"][vc_column_text]\n<h2>UK data centres<\/h2>\n<h3>Secure, resilient and available<\/h3>\nRunning on the highest quality hardware and meeting the utmost security standards, our facilities are UK leaders. Accredited to ISO27001 with IL4 capabilities, our Tier III data centres are used by some of the countries leading organisations including FTSE100 companies and central government departments.\n\nOur personal approach to business gives our customers complete confidence in our team's knowledge and ability to mitigate against risk and deliver operationally excellent services.\n\nOur Dundee Headquarters house 200 racks. Download our technical fact sheet here to learn more about our Dundee facility:\n\n[downloadButton file_name=\"The-Data-Centre.pdf\" unique_id=\"Data Centre Fact Sheet Data Centre Page\"][\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column width=\"1\/1\"][vc_column_text]\n<h2>brightsolid Aberdeen, opening April 2015<\/h2>\n<h3>New Tier III, brightsolid 400 rack data centre<\/h3>\n<h4>Keysource selected as build partner<\/h4>\nKeysource are experts in data centre design and build with experience of building facilities here in the North East of Scotland and a strong heritage in the Oil and Gas space, serving the industry with flexible solutions that cater for the highest density IT.\nbrightsolid Aberdeen will showcase the environmental sustainability of <a href=\"http:\/\/www.keysource.co.uk\/\">Keysource <\/a>data centre design while using the operational best practice we’ve developed at our <a title=\"Data Centre\" href=\"https:\/\/www.brightsolid.com\/dedicated-cloud-servers\/data-centre\/\">existing site<\/a> in Dundee.\n\nMike West, Managing Director Keysource, <span style=\"color: #c51c71;\"><em>“We are delighted to be working with brightsolid to develop this high performance facility in such an exciting market. We’ve been able to bring our experience of working with organisations across all sectors but particularly within Oil &amp; Gas to provide a highly efficient, flexible solution which caters for the latest high density IT.”<\/em><\/span>\n\n[downloadButton file_name=\"Aberdeen-Data-Centre-Flyer.pdf\" unique_id=\"Aberdeen Data Centre\"]\n<h4>Energy Efficient<\/h4>\nThe Aberdeen facility will achieve a PUE of sub 1.25 with the ability to cool up to 25kW per rack, made possible by a unique approach to cooling, <a href=\"http:\/\/www.ecofris.co.uk\/\">ecofris<\/a>. This technology is based on an optimised chilled water cooling system that controls the airflow and temperature within each data hall. Initially two 500kW systems will be installed with an additional unit moved into production when the load increases past 500kW to ensure we retain N+1 at all times.\n\n<a hr","weightedVote":"2.5","numVotes":"0","author":"","community":"1","dateAdded":"2015-07-23","pattern":"(>[^<]*)brightsolid([^<]*<)","replace":"","state":"{\"substEnabled\":false}"}