{"id":"174009","urlID":"3bffb","name":"Chrome App Store","description":"","content":"syonip@gmail.com\nThis extension saves pages to view for later.\nFREE\nVIEW LATER - save links in a stack(39)\nBlocks popups and popunders no matter where you click on a page.\nFREE\nPoper Blocker(4016)\nQuickly share web pages to all of your social networks using the Hootsuite Hootlet.\nFREE\nHootsuite Hootlet(943)\nProtect your computer away from malicious website attack.\nFREE\nAdvanced SystemCare Surfing Protection(219)\nPin the things you find on the web\nFREE\nPin It Button(2427)\nList, search, and open your Pocket links from a convenient popup.\nFREE\nPickpocket(188)\nSave events from webpages or create custom ones with a couple clicks. Set and share reminders — all without leaving the page.\nFREE\nStanza - Date Clipper for Google Calendar™(120)\nManage Your Browser Sessions\nFREE\nSession Buddy(13667)\nScreenshot capture.\nFREE\nTechSmith Snagit (Extension)(1118)\nConverts a web page to PDF\nFREE\n\nSee who opens your emails and clicks on your links, with email tracking analytics and templates for Gmail.\nFREE\n\n\nFREE\nBoomerang Calendar(87)\nAnalyze webpage using built-in filters. Download videos, pdf files, html, images\nFREE\nGetThemAll Video Downloader(2033)\nArchive a complete page into a single HTML file\nFREE\nSingleFile(377)\nAdd Official Toggl Online Timer to Popular Web Tools\nFREE\nToggl Button(134)\ngoMovix Start is a new Chrome extension for a quick click-and-visit experience.\nFREE\ngoMovix Start(4)\nImTranslator is a set of multilingual tools designed to remove language barriers across the World Wide Web\nFREE\nImTranslator: Translator, Dictionary, TTS(1116)\nStay focused and let Block Site automatically blocks websites of your choice. Best for procrastination problem\nFREE\nBlock site(6628)\nLaunch Chrome apps using a fancy popup. Reorder them as you like.\nFREE\nApps Launcher(104)\nInternet simply without ads!\nFREE\nSimply Block Ads!(981)\n","weightedVote":"2.5","numVotes":"0","author":"","community":"1","dateAdded":"2015-07-26","pattern":"\/.*(FREE)\\s(.*)\\(([0-9]*)\\)\\s(.*)\/g","replace":"\\n$1,$2,$3,$4","state":"{\"substEnabled\":true}"}