{"id":"174897","urlID":"3bi2j","name":"Parse salary amount (AMD)","description":"","content":"To be negotiated depending on the experience.\nTo be discussed.\nThe total amount of payment for the performed services should not exceed 2,800 Euros (700 Euros per 1 full-time month) for 4 full-time months of service. Payment will be made on a monthly basis in AMD.\nThe Project Assistant will be self-employed and will undertake the full responsibility for the payment of all taxes and obligations deriving from the legislation in force, including for those related to medical and social insurances.\nThe Interpreter will be self-employed and will undertake the full responsibility for the payment of all taxes and obligations deriving from the legislation in force, including for those related to medical and social insurances.\nThe Company offers a salary and social package, creative working environment as well as continuous capability development opportunities.\nStarting from 600,000 AMD.\nNegotiable plus a full medical insurance and professional training.\nNegotiable plus a full medical insurance and professional training.\nNegotiable plus a full medical insurance and professional training.\nNegotiable plus a full medical insurance and professional training.\nNegotiable based on the previous work experience and skills.\nNegotiable based on the previous work experience and skills.\nMarket competitive, based on qualifications.\nMarket competitive based on qualifications.\nMarket competitive based on qualifications.\nHighly competitive, commensurate with experience plus a medical insurance and bonus program.\nHighly competitive depending on the previous experience and skills.\nHighly competitive depending on the previous experience and skills with a benefit package including a medical insurance, training programs, sport activities and a relaxation massage.\nHighly competitive based on the previous experience.\nHighly competitive based on the background and experience plus an attractive bonus system, medical insurance for the employee and his family members (wife, kids), compensations for the employee's attendance at sport clubs and trainings.\nHighly competitive\nHighly competitive\nHighly competitive\nHighly competitive\nFrom 300,000 to 600,000 AMD plus increase of salaries every 3 months.\nDepending on skills.\nCompetitive, subsidized lunch and other applicable benefits.\nCompetitive, subsidized lunch and other applicable benefits.\nCompetitive, good benefits, including medical insurance, loan program, lunch subsidy and stock options.\nCompetitive, good benefits including medical insurance, loan program, lunch subsidy and stock options.\nCompetitive, bonus program plus insurance package.\nCompetitive, advanced benefit package.\nCompetitive, advanced benefit package.\nCompetitive salary, medical insurance, flexible bonus scheme, comprehensive benefits package (table tennis, chess, football, gym subscription), free healthy snacks and drinks.\nCompetitive plus bonus programs, a medical insurance, professional development opportunities and flexible benefits package.\nCompetitive plus bonus programs, a medical insurance, professional development opportunities and flexible benefits package.\nCompetitive plus bonus programs, a medical insurance, professional development opportunities and a flexible benefits package.\nCompetitive plus bonus programs, a medical insurance, professional development opportunities and a flexible benefits package.\nCompetitive plus benefits which include a comprehensive medical insurance.\nCompetitive plus benefit pack","weightedVote":"4.87087","numVotes":"17","author":"gagvirus","community":"1","dateAdded":"2015-08-09","pattern":"\/(\\d{1,4}((\\,|\\.|\\s)(\\d00)){1,2}|(\\d{3,7}))\/g","replace":"","state":"{\"substEnabled\":false}"}