{"id":"155483","urlID":"39p6h","name":"Meeting(Community)","description":"","content":"I am working on the Coast Post and working also on the idea of dealing with the meetings that are to do with the Coast's stuff...but have noticed:\n\nthere are some members that have been here for quite some time...\n\nbut are now less active than they were at one time... This I belive to be because \nthe idea of the fact that the Clubhouse model is being inacted and that some behaviours may be encouraged...and others discouraged...\nas well...\n\nin addition, there are some who are not in favor of eliteism, and favortism, when it comes to the members and the staff...in addition to the idea of the Clubhouse.\n\nMy idea is also that those that are not in favor of the idea of perks...are somewhat related to the anti-eliteism thinking and the anti-favortism thinking in the Clubhouse.\n\nI am definately not opposed to this thinking...although, we definately must be aware of the idea of the anti-ness of these meetings...and the fact that some people may vote all the time...and be very active in the voting process...and others may not vote at all...hence not be represented in the population(s) of the Clubhouse...I am very much amazed that there are several people...in turn who are very active...outside the Clubhouse that need to participate more in the Clubhouse...but these people may be doing this because they are just wanting the activities, but not necessarially the (structure) of the Clubhouse to be imposed on them.\n\nI have also heard of oposition, to the meetings in the Clubhouse...and definately I agree there are alot of meetings...but this also means that many people can be heard and represented as well. \n\nI am somewhat amazed, and maybe a litte suprised that all the people that are active in the meeting and tend to speak up when the meeting is small, but when the meeting is large...they may not be represented since they don't vote a dilligently.\n\nWe have to represent a large population of the member of the Clubhouse, and we need to be very careful to be heard as much as possible...and yet...we have to allow the staff to have their opinion(s) as well and input...since they are representing us as well.\n","weightedVote":"2.5","numVotes":"0","author":"book20","community":"1","dateAdded":"2014-10-21","pattern":"([A-Z])\\w+","replace":"","state":""}